In [1]:
# Import modules
import pandas as pd

In [2]:
# Read json file
url = "http://api.open-notify.org/astros.json"
first_json = pd.read_json(url)
first_json.head()

                                             people  number  message
0        {'craft': 'ISS', 'name': 'Oleg Kononenko'}      12  success
1          {'craft': 'ISS', 'name': 'Nikolai Chub'}      12  success
2  {'craft': 'ISS', 'name': 'Tracy Caldwell Dyson'}      12  success
3      {'craft': 'ISS', 'name': 'Matthew Dominick'}      12  success
4       {'craft': 'ISS', 'name': 'Michael Barratt'}      12  success

In [4]:
# Writing to the JSON file
first_json.to_json('json_columns.json', orient="columns")
first_json.to_json('json_index.json', orient="index")

In [ ]:
# alternate way of loading JSON file
# this will open the JSON file as a dictionary

import json

# load json object
with open('nested.json') as f:
    nested_json = json.load(f)
print(nested_json)
print(type(nested_json))

{'article': [{'id': '01', 'language': 'JSON', 'edition': 'first', 'author': 'Allen'}, {'id': '02', 'language': 'Python', 'edition': 'second', 'author': 'Aditya Sharma'}], 'blog': [{'name': 'Datacamp', 'URL': 'datacamp.com'}]}
<class 'dict'>

In [8]:
# Now we can use Pandas to normalize the JSON file
pd.json_normalize(nested_json)

,article,blog
0,"[{'id': '01', 'language': 'JSON', 'edition': '...","[{'name': 'Datacamp', 'URL': 'datacamp.com'}]"

In [ ]:
'''Adding a record_path parameter to facilitate normalization
by putting focus on a specific key'''
blog = pd.json_normalize(nested_json, record_path='blog')
blog.head()

       name           URL
0  Datacamp  datacamp.com

In [10]:
'''Adding a record_path parameter to facilitate normalization
by putting focus on a specific key from file'''
article = pd.json_normalize(nested_json, record_path='article')
article.head()

   id language edition         author
0  01     JSON   first          Allen
1  02   Python  second  Aditya Sharma

json_normalize() has 3 main parameters:
* data - input data
* record_path - nested elements
* meta - let them as they are elements

In [13]:
# Another example of JSON normalization

#define json string
data = [{"state": "Florida",
         "shortname": "FL",
         "info":{"governor": "Rick Scott"},
         "counties": [{"name": "Dade","population": 12345},
                      {"name": "Broward", "population": 40000},
                      {"name": "Palm Beach", "population": 60000}]},
        {"state": "Ohio",
         "shortname": "OH",
         "info": {"governor": "John Kasich"},
         "counties" : [{"name": "Summit", "population": 1234},
                       {"name": "Cuyahoga", "population": 1337}]}]

In [14]:
pd.json_normalize(data)
pd.json_normalize(data=data, record_path='counties', meta=['state', 'shortname', ['info', 'governor']])

         name  population    state shortname info.governor
0        Dade       12345  Florida        FL    Rick Scott
1     Broward       40000  Florida        FL    Rick Scott
2  Palm Beach       60000  Florida        FL    Rick Scott
3      Summit        1234     Ohio        OH   John Kasich
4    Cuyahoga        1337     Ohio        OH   John Kasich